tap "azure/functions"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "microsoft/foundrylocal"
tap "mongodb/brew"
tap "vladkens/tap"
brew "ack"
brew "adr-tools"
brew "advancecomp"
brew "git"
brew "asdf"
brew "python@3.13"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "boost"
brew "brew-cask-completion"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "fabric-ai"
brew "findutils"
brew "fzf"
brew "gh"
brew "gibo"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grc"
brew "grep"
brew "httpie"
brew "hub"
brew "icdiff"
brew "iperf"
brew "jq"
brew "llvm"
brew "mackup"
brew "mas"
brew "node"
brew "moreutils"
brew "mtr"
brew "nano"
brew "ngrep"
brew "nmap"
brew "openssh"
brew "opentofu"
brew "p7zip"
brew "pidof"
brew "pigz"
brew "pinentry-mac"
brew "pv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "roundup"
brew "screen"
brew "spark"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "subversion"
brew "talosctl"
brew "tcping"
brew "tcptraceroute"
brew "telnet"
brew "terminal-notifier"
brew "tfsec"
brew "the_silver_searcher"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "trivy"
brew "vbindiff"
brew "vim"
brew "wget"
brew "wifi-password"
brew "woff2"
brew "z"
brew "zopfli"
brew "zsh"
brew "zsh-completions"
brew "azure/functions/azure-functions-core-tools@3"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "microsoft/foundrylocal/foundrylocal"
brew "mongodb/brew/mongodb-community"
brew "vladkens/tap/macmon"
cask "amazon-chime"
cask "anaconda"
cask "audio-hijack"
cask "docker-desktop"
cask "elgato-stream-deck"
cask "farrago"
cask "flux-app"
cask "font-domine"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "github"
cask "grammarly"
cask "graphiql"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboard-maestro"
cask "loopback"
cask "microsoft-remote-desktop"
cask "moom"
cask "notion"
cask "powershell"
cask "qlprettypatch"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "sequel-pro"
cask "soundsource"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webpquicklook"
cask "zenmap"
mas "1Password for Safari", id: 1569813296
mas "BrowserFairy", id: 1499080593
mas "iMovie", id: 408981434
mas "Microsoft To Do", id: 1274495053
mas "RMS_sharing", id: 908570259
mas "Tailscale", id: 1475387142
mas "Todoist", id: 585829637
mas "Tot", id: 1491071483
mas "Ulysses", id: 1225570693
mas "Xcode", id: 497799835
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "codeium.codeium"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabric.vscode-fabric"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "keesschollaart.vscode-home-assistant"
vscode "kevinrose.vsc-python-indent"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-apimanagement"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "synapsevscode.synapse"
vscode "teamsdevapp.ms-teams-vscode-extension"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
