# TAPS

tap "azure/functions"
tap "bramstein/webfonttools"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
# tap "mongodb/brew"


# SYSTEM - GNU
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"

# TERMINALS
brew "bash"
brew "bash-completion@2"
brew "zsh"
brew "zsh-completion"

# TOOLS
brew "git"
brew "tmux"
brew "z"
brew "vim"
brew "grep"
brew "nano"
brew "openssh"
brew "screen"
brew "wget"

# UTILS
brew "ack"
brew "advancecomp"
brew "brew-cask-completion"
brew "cloc"
brew "cmake"
brew "diff-so-fancy"
brew "fzf"
brew "gibo"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-quick-stats"
brew "graphviz"
brew "grc"
brew "httpie"
brew "hub"
brew "icdiff"
brew "jq"
brew "mas"
brew "mtr"
brew "ngrep"
brew "nmap"
brew "p7zip"
brew "pidof"
brew "pigz"
brew "pv"
brew "readline"
brew "reattach-to-user-namespace"
brew "rename"
brew "roundup"
brew "spark"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "trash-cli"
brew "tree"
brew "vbindiff"
brew "wifi-password"
brew "zopfli"

# BACKUP"
brew "mackup"

# DATABASES
# brew "postgresql"
# brew "mysql@5.7"
# brew "redis"
# brew "mongodb-community"

# FONTS
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "svn" #Needed for google fonts
cask "font-domine"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
# cask "font-source-sans-pro"
cask "font-ubuntu"

# SECURITY
# cask "dashlane"
cask "keybase"
cask "gpg-suite"
brew "gnupg"
brew "pinentry-mac"
cask "1password"
cask "1password-cli"

# DESIGN
cask "abstract"
cask "sketch"
cask "zeplin"

# DEV
cask "dash"
#cask "google-chrome-canary"
cask "graphiql"
cask "imagealpha"
cask "imageoptim"
cask "ngrok"
cask "sequel-pro"
cask "visual-studio-code"
# cask "dotnet-sdk"
brew "adr-tools"
brew "asdf"
# brew "n"
# brew "yarn"
brew "go"
brew "pyenv"
brew "pyenv-virtualenv"
# brew "rbenv"
# brew "ruby-build"
# brew "rbenv-gemset"

# QUICKLOOK
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
# cask "betterzipql"
# cask "qlimagesize"
cask "webpquicklook"
# cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# DEVOPS
# cask "aws-vault"
# cask "virtualbox"
cask "vagrant"
brew "awscli"
# brew "nginx"
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@3"
brew "terraform"
cask "powershell"
brew "kubernetes-cli"
brew "kubectx"
brew "openshift-cli"
brew "helm"
brew "minikube"


# DOCKER
brew "docker"
# brew "docker-compose"
# brew "docker-machine"
# brew "xhyve"
# brew "docker-machine-driver-xhyve"
# brew "boot2docker"

# FUN
brew "cmatrix"
# cask "spotmenu"



# GENERAL
cask "arc"
cask "caffeine"
# cask "dropbox"
cask "firefox"
cask "g-desktop-suite"
cask "google-chrome"
cask "grammarly"
cask "iterm2"
# cask "moom"
cask "flux"
# cask "microsoft-outlook" 
# cask "microsoft-word"
# cask "microsoft-excel"
# cask "microsoft-powerpoint"
cask "microsoft-edge"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
# cask "todoist"
cask "sublime-text"
# cask "microsoft-remote-desktop"
cask "github"
cask "notion"
# cask "parallels"

# Chat and Meetings
# cask "slack"
cask "whatsapp"
#cask "zoom"
#cask "microsoft-teams"

# Media Apps
cask "farrago"
cask "audio-hijack"
cask "loopback"
cask "soundsource"
cask "spotify"
cask "vlc"
cask "obs"
# cask "obs-virtualcam"
cask "elgato-stream-deck"

# APP STORE
mas "1Password", id: 1333542190
#mas "Airmail", id: 918858936
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Outlook", id: 985367838
mas "Microsoft OneNote", id:784801555
mas "Fantastical - Calendar & Tasks", id: 975937182
# mas "Slack for Desktop", id: 803453959
mas "Parallels Desktop", id: 1085114709
mas "Microsoft Remote Desktop", id: 1295203466
mas "Moom", id: 419330170
mas "Todoist: To-Do List & Tasks", id: 585829637
mas "Tot", id: 1491071483
