# Brewfile for this machine
# Merged with base essentials

# === Base Packages (from base/config/brew/.brewfile) ===

tap "azure/functions"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "fluxcd/tap"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "pulumi/tap"
tap "siderolabs/tap"
brew "ack"
brew "adr-tools"
brew "advancecomp"
brew "age"
brew "git"
brew "asdf"
brew "awscli"
brew "azure-cli"
brew "bandit"
brew "bash"
brew "bash-completion@2"
brew "glib"
brew "harfbuzz"
brew "bfg"
brew "brew-cask-completion"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cryptography"
brew "diff-so-fancy"
brew "ffmpeg"
brew "findutils"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "gibo"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "python@3.12"
brew "grc"
brew "grep"
brew "helm"
brew "httpie"
brew "icdiff"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "mackup"
brew "macmon"
brew "mas"
brew "minikube"
brew "mongosh"
brew "moreutils"
brew "mtr"
brew "nano"
brew "ngrep"
brew "nmap"
brew "openshift-cli"
brew "openssh"
brew "p7zip"
brew "pidof"
brew "pigz"
brew "pinentry-mac"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "roundup"
brew "screen"
brew "sops"
brew "spark"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sshpass"
brew "tailwindcss"
brew "talhelper"
brew "telnet"
brew "temporal"
brew "terminal-notifier"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "trivy"
brew "vbindiff"
brew "vim"
brew "wget"
brew "wifi-password"
brew "woff2"
brew "yq"
brew "yt-dlp"
brew "z"
brew "zopfli"
brew "zsh"
brew "zsh-completions"
brew "azure/functions/azure-functions-core-tools@3"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "fluxcd/tap/flux"
brew "mongodb/brew/mongodb-community"
brew "pulumi/tap/pulumi"
brew "siderolabs/tap/talosctl"
cask "1password"
cask "1password-cli"
cask "arc"
cask "audio-hijack"
cask "caffeine"
cask "dash"
cask "elgato-stream-deck"
cask "farrago"
cask "firefox"
cask "flutter"
cask "flux-app"
cask "font-domine"
cask "font-fira-code"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "g-desktop-suite"
cask "gcloud-cli"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "grammarly"
cask "graphiql"
cask "imagealpha"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "keybase"
cask "loopback"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "ngrok"
cask "notion"
cask "obs"
cask "powershell"
cask "qlprettypatch"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "sequel-ace"
cask "soundsource"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Fantastical", id: 975937182
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Parallels Desktop", id: 1085114709
mas "Tailscale", id: 1475387142
mas "Todoist", id: 585829637
mas "Tot", id: 1491071483
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "codeium.codeium"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabric.vscode-fabric"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "keesschollaart.vscode-home-assistant"
vscode "kevinrose.vsc-python-indent"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-apimanagement"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "synapsevscode.synapse"
vscode "teamsdevapp.ms-teams-vscode-extension"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"

# === Machine-Specific Packages ===

brew "kubecfg"
brew "talosctl"
cask "docker-desktop"
cask "kubecontext"
cask "windsurf"
